constantAngleSlopeTurbKWUProfileInlet100621GLZ/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

    alphaK1         0.891783523215;
    alphaK2         1.00015535002;
    alphaOmega1     0.499448334734;
    alphaOmega2	    0.855849001675;
    beta1           0.0750539689601;
    beta2           0.0828231175887;
    betaStar        0.0900647627521; 
    gamma1          0.555589661487;
    gamma2          0.439978703162;
    a1              0.310223071702;
    b1              0.999296793477;
    c1              10.0071958613;
    F3          no;
}


// ************************************************************************* //
